[
    {
      "_id": "1",
      "skill": "HTML",
      "logo": "https://i.ibb.co.com/vztnC6J/html.png",
      "description": "HTML (HyperText Markup Language) is the standard language used to create and design webpages. It structures the content and elements of a webpage, including headings, paragraphs, links, images, and other content.",
      "proficiency": "Advanced"
    },
    {
      "_id": "2",
      "skill": "CSS",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/6/62/CSS3_logo.svg",
      "description": "CSS (Cascading Style Sheets) is used to style and layout web pages. It allows developers to design and create visually appealing websites by controlling the layout, colors, fonts, and other visual elements of the webpage.",
      "proficiency": "Advanced"
    },
    {
      "_id": "3",
      "skill": "JavaScript",
      "logo": "https://i.ibb.co.com/Z12M9Kw/js.webp",
      "description": "JavaScript is a high-level, dynamic programming language used for creating interactive and dynamic content on websites. It runs on the client side and enables functionalities such as form validation, animations, and AJAX requests.",
      "proficiency": "Advanced"
    },
    {
      "_id": "4",
      "skill": "React",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
      "description": "React is a JavaScript library for building user interfaces, particularly single-page applications. It allows developers to create reusable UI components, manage state, and update the DOM efficiently.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "5",
      "skill": "Tailwind CSS",
      "logo": "https://i.ibb.co.com/KKNF9Mj/tailwind.png",
      "description": "Tailwind CSS is a utility-first CSS framework that provides pre-built classes for common styling properties. It enables developers to create custom designs quickly and efficiently by applying utility classes directly in HTML.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "6",
      "skill": "Node.js",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Node.js_logo.svg",
      "description": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. It allows developers to execute JavaScript code server-side, enabling full-stack JavaScript development for scalable web applications.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "7",
      "skill": "Express.js",
      "logo": "https://i.ibb.co.com/NyPzxZp/express.png",
      "description": "Express.js is a minimal and flexible Node.js web application framework that provides robust features for web and mobile applications. It simplifies routing, middleware, and request handling.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "8",
      "skill": "Firebase",
      "logo": "https://i.ibb.co.com/25JMdFp/firebase.png",
      "description": "Firebase is a platform developed by Google for creating mobile and web applications. It offers various services, including authentication, real-time databases, analytics, and hosting.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "9",
      "skill": "MongoDB",
      "logo": "https://i.ibb.co.com/59K1WhV/mongodb.webp",
      "description": "MongoDB is a NoSQL database that uses a document-oriented data model. It is designed for scalability and flexibility, making it suitable for handling large amounts of unstructured data in modern web applications.",
      "proficiency": "Intermediate"
    },
    {
      "_id": "10",
      "skill": "JWT Token",
      "logo": "https://i.ibb.co.com/NmJ2CmK/jwt.png",
      "description": "JWT (JSON Web Token) is an open standard for securely transmitting information between parties as a JSON object. It is often used for authentication and authorization in web applications.",
      "proficiency": "Intermediate"
    }
  ]
  